
// 7. Создайте объект "животное" с методом "издать звук".
// 8. Измените значение поля "цвет" в объекте "автомобиль".
// 9. Создайте объект "продукт" с полями "название", "цена" и "количество".
// 10. Увеличьте количество продукта в объекте "продукт" на 5.
// 11. Создайте объект "компьютер" с методом "включить".
// 12. Измените значение поля "адрес" в объекте "пользователь".
// 13. Создайте объект "фрукт" с методом "почистить".
// 14. Выведите на экран только имена всех полей объекта "пользователь".
// 15. Создайте объект "город" с полями "название", "население" и "страна".

// // 1. Создайте объект "автомобиль" с полями "марка", "год выпуска" и "цвет".
// 2. Добавьте метод "завести двигатель" к объекту "автомобиль".
// let car = {
//     model : `Subaru impeza`,
//     releaseYear : 1992,
//     color : `silver`,
// }

// function startEngine() {
//     alert(`Switch it up, driver!`);
// }
// car.startEngine = startEngine;
// car.startEngine();

// // 3. Создайте объект "пользователь" с полями "имя", "возраст" и "адрес".
// 4. Измените значение поля "возраст" в объекте "пользователь".
// let user = {
//     name : `Nina`,
//     age : 26,
//     address : `Bald mountain 22/21`,
// }

// let age = user.age;
// age = 22;

// 5. Создайте объект "книга" с полями "название", "автор" и "год издания".
// 6. Выведите на экран информацию о книге, используя поля объекта "книга".

let book = {
    name : `How to quit smoking`,
    author : `Alen Karr`,
    yearReleased : 1550,
}

nameX.innerText = book.name
authorX.innerText = book.author
yearReleasedX.innerText = book.yearReleased
